DataProcessors/бит_ПодборЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ПодборЛицевыхСчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Подъезды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаВыбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/бит_Квартиры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_Квартиры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_СписокЗданий</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомнат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоБТИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КадастровыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПодъезда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйНомерГИСЖКХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Подъезды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтвержденоПоставщиком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НомерКвартирыДляСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/бит_ПодборЛицевыхСчетов/Forms/ФормаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте
Перем ЗакрытьБезВопроса; // Хранит значение после ответа на вопрос.

#КонецОбласти

#Область ПроцедурыИФункцииУправленияВнешнимВидомФорм

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ПанельВыбранного.Видимость = ОтобразитьВыбранное;
	
КонецПроцедуры // УправлениеЭлементамиФормы()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокУслуг = Параметры.СписокУслуг;
	
	Элементы.СписокУслуг.ТолькоПросмотр = СписокУслуг.Количество() > 0;
	
	Объект.Улица = Параметры.Улица;
	
	СписокУлиц = Параметры.СписокУлиц;
	
	Если НЕ Объект.Улица.Пустая() Тогда
		
		бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокЛицевыхСчетов,
		"Улица",
		Объект.Улица,
		Истина,
		ВидСравненияКомпоновкиДанных.Равно);
		
		Элементы.Улица.Доступность = СписокУлиц.Количество() > 0;
		
	КонецЕсли;
	
	Объект.Здание = Параметры.Здание;
	
	СписокЗданий = Параметры.СписокЗданий;
	
	Если НЕ Объект.Здание.Пустая() Тогда
		
		бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокЛицевыхСчетов,
		"Здание",
		Объект.Здание,
		Истина,
		ВидСравненияКомпоновкиДанных.Равно);
		
		Элементы.Здание.Доступность = СписокЗданий.Количество() > 0;
		
	КонецЕсли;
	
	Если НЕ Параметры.СписокЛС.Количество() = 0 Тогда
		
		бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокЛицевыхСчетов,
		"ЛицевойСчет",
		Параметры.СписокЛС,
		Истина,
		?(Параметры.ВСписке, ВидСравненияКомпоновкиДанных.ВСписке, ВидСравненияКомпоновкиДанных.НеВСписке));
		
	КонецЕсли; 
	
	Дата = ТекущаяДата();
	
	Если ЗначениеЗаполнено(Параметры.Дата) Тогда
		
		Дата = Параметры.Дата;
		
	КонецЕсли; 
	
	СписокЛицевыхСчетов.Параметры.УстановитьЗначениеПараметра("Дата", КонецДня(Дата));
	
	ТекОтбор = "ПоАдресу";
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// Установить видимость реквизитов и заголовков колонок.	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Параметры.ОткрытоИзДокумента Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Обработка подбора лицевых счетов предназначена для открытия только из документов.");
		
		Отказ = Истина;
		
	КонецЕсли; 
	
	ЗакрытьБезВопроса = Ложь;
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// БИТ_ЖКХ 08.09.2016 18:26:49 Начало правки... 
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 08.09.2016 18:26:51 Конец правки.

	
	Если Не ПеренестиВДокумент И Объект.ТаблицаВыбора.Количество() > 0 Тогда
		
		Если ЗакрытьБезВопроса = Ложь Тогда
			Отказ = Истина;
			
			ОтветНаВопрос = Неопределено;
			
			ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), "Подобранные лицевые счета не перенесены в документ. Перенести?", РежимДиалогаВопрос.ДаНетОтмена);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    ОтветНаВопрос = РезультатВопроса;
    
    Если ОтветНаВопрос = КодВозвратаДиалога.Отмена Тогда
        ЗакрытьБезВопроса = Ложь;
    ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
        ЗакрытьБезВопроса = Истина;
        Этаформа.Закрыть();
		
    ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
        ПеренестиВДокумент = Истина;
        ЗакрытьБезВопроса = Истина;
        
        Этаформа.Закрыть();
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// БИТ_ЖКХ 08.09.2016 18:26:49 Начало правки... 
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 08.09.2016 18:26:51 Конец правки.

	Если ПеренестиВДокумент Тогда
		
		АдресЛСВХранилище = ПоместитьЛСВХранилище();
		Структура = Новый Структура("АдресЛСВХранилище", АдресЛСВХранилище);
		ПеренестиВДокумент = Истина;
		ОповеститьОВыборе(Структура);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтобразитьВыбранноеПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	Объект.Здание   = Неопределено;
	Объект.Квартира = Неопределено;
	
	Если СписокУлиц.Количество() > 0 И Объект.Улица.Пустая() Тогда
		
		Объект.Улица = СписокУлиц[0].Значение;
		
	КонецЕсли; 
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокЛицевыхСчетов,
	"Улица",
	Объект.Улица,
	НЕ Объект.Улица.Пустая(),
	ВидСравненияКомпоновкиДанных.Равно);
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокЛицевыхСчетов,
	"Здание");
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокЛицевыхСчетов,
	"Квартира");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	Объект.Квартира = Неопределено; 
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокЛицевыхСчетов,
	"Здание",
	Объект.Здание,
	НЕ Объект.Здание.Пустая(),
	ВидСравненияКомпоновкиДанных.Равно);
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокЛицевыхСчетов,
	"Квартира");
	
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокЛицевыхСчетов,
	"Квартира",
	Объект.Квартира,
	НЕ Объект.Квартира.Пустая(),
	ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветсвенноеЛицоПриИзменении(Элемент)
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокЛицевыхСчетов,
	"ОтветственноеЛицо",
	Объект.ОтветственноеЛицо,
	НЕ Объект.ОтветственноеЛицо.Пустая(),
	ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКвартирыПриИзменении(Элемент)
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокЛицевыхСчетов,
	"ТипКвартиры",
	Объект.ТипКвартиры,
	НЕ Объект.ТипКвартиры.Пустая(),
	ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусКвартирыПриИзменении(Элемент)
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокЛицевыхСчетов,
	"СтатусКвартиры",
	Объект.СтатусКвартиры,
	НЕ Объект.СтатусКвартиры.Пустая(),
	ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если СписокУлиц.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Ссылка", СписокУлиц);
		
		ОткрытьФорму("Справочник.бит_СписокУлиц.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Улица"      , Объект.Улица);
	
	Если СписокЗданий.Количество() > 0 Тогда
		Отбор.Вставить("Ссылка", СписокЗданий);
	КонецЕсли; 
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартираНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Здание", Объект.Здание);
	
	ОткрытьФорму("Справочник.бит_Квартиры.Форма.ФормаВыбора", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодъездПриИзменении(Элемент) 
	
	Объект.Квартира = Неопределено;
	Объект.Этаж = Неопределено;
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокЛицевыхСчетов,
	"Подъезд",
	Объект.Подъезд,
	НЕ Объект.Подъезд.Пустая(),
	ВидСравненияКомпоновкиДанных.Равно);
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокЛицевыхСчетов,
	"Квартира");

	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокЛицевыхСчетов,
	"Этаж");    
	
КонецПроцедуры

&НаКлиенте
Процедура ПодъездНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец"       , Объект.Здание);
	
	Если СписокЗданий.Количество() > 0 Тогда
		Отбор.Вставить("Ссылка", СписокЗданий);
	КонецЕсли; 
	
	ОткрытьФорму("Справочник.бит_Подъезды.Форма.ФормаВыбора", Новый Структура("Отбор", Отбор), Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ЭтажПриИзменении(Элемент) 
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокЛицевыхСчетов,
	"Этаж",
	Объект.Этаж,
	Объект.Этаж <> 0,
	ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтажНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Этаж"      , Объект.Этаж);
	
	Если СписокЗданий.Количество() > 0 Тогда
		Отбор.Вставить("Ссылка", СписокЗданий);
	КонецЕсли; 
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляСписокЛицевыхСчетов

&НаКлиенте
Процедура СписокЛицевыхСчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяУслуга = Элементы.СписокУслуг.ТекущиеДанные;
	
	Если НЕ ВыбраннаяСтрока = Неопределено Тогда
		
		Отбор = Новый Структура;
		
		Для каждого ЭлементМассива Из ВыбраннаяСтрока Цикл
			
			Услуга = мКэшЗначений.ПустаяУслуга;
			
			Если НЕ ТекущаяУслуга = Неопределено Тогда
				Услуга = ТекущаяУслуга.Значение;
			КонецЕсли;
			
			Отбор.Очистить();
			Отбор.Вставить("Услуга"     , Услуга);
			Отбор.Вставить("ЛицевойСчет", ЭлементМассива);
			
			Поиск = Объект.ТаблицаВыбора.НайтиСтроки(Отбор);
			
			Если Поиск.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			НоваяСтрока = Объект.ТаблицаВыбора.Добавить();
			
			НоваяСтрока.Услуга      = Услуга;
			НоваяСтрока.ЛицевойСчет = ЭлементМассива;
			УлицаЛицевогоСчета = ПолучитьУлицуЛицевогоСчетаНаСервере(ЭлементМассива);
			Здание = ПолучитьЗданиеНаСервере(ЭлементМассива);
			Квартира = ПолучитьКвартируНаСервере(ЭлементМассива);
			НоваяСтрока.Адрес       = "ул. " + УлицаЛицевогоСчета + ", д. " + Здание + ", кв. " + Квартира;
			НоваяСтрока.Здание      = Здание
			
		КонецЦикла;
		
	КонецЕсли;
	
	ПересчитатьЭлементы();
	
КонецПроцедуры


&НаСервере
Функция ПолучитьУлицуЛицевогоСчетаНаСервере(ЭлементМассива)
	
	Возврат ЭлементМассива.УлицаЛицевогоСчета;	
	
КонецФункции

&НаСервере
Функция ПолучитьЗданиеНаСервере(ЭлементМассива)
	
	Возврат ЭлементМассива.Здание;	
	
КонецФункции

&НаСервере
Функция ПолучитьКвартируНаСервере(ЭлементМассива)
	
	Возврат ЭлементМассива.Квартира;	
	
КонецФункции

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляТаблицаВыбора

&НаКлиенте
Процедура ТаблицаВыбораПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораПослеУдаления(Элемент)
	
	ПересчитатьЭлементы();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	КэшПеречисления = Новый Структура;
	КэшированныеЗначения.Вставить("ПустаяУслуга", Справочники.бит_УслугиЖКХ.ПустаяСсылка());
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере
Функция ПоместитьЛСВХранилище()
	
	ТаблицаЛС = Объект.ТаблицаВыбора.Выгрузить();
	
	АдресЛСВХранилище = ПоместитьВоВременноеХранилище(ТаблицаЛС, УникальныйИдентификатор);
	
	Возврат АдресЛСВХранилище;
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьЭлементы()
	
	КолЭлементов = Объект.ТаблицаВыбора.Количество();
	
	Если КолЭлементов > 0 Тогда
		Элементы.НадписьВыбранного.Заголовок = "Выбрано элементов : " + Объект.ТаблицаВыбора.Количество();
	Иначе
		Элементы.НадписьВыбранного.Заголовок = "Выбрано элементов : 0";
	КонецЕсли; 
	
	Объект.ТаблицаВыбора.Сортировать("ЛицевойСчет Возр");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая",, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущаяУслуга = Элементы.СписокУслуг.ТекущиеДанные;
	
	Выделение = Элементы.СписокЛицевыхСчетов.ВыделенныеСтроки;
	
	Если НЕ Выделение = Неопределено Тогда
		
		Отбор = Новый Структура;
		
		Для каждого ЭлементМассива Из Выделение Цикл
			
			Услуга = Неопределено;
			
			Если НЕ ТекущаяУслуга = Неопределено Тогда
				Услуга = ТекущаяУслуга.Значение;
			КонецЕсли;
			
			Отбор.Очистить();
			Отбор.Вставить("Услуга"     , Услуга);
			Отбор.Вставить("ЛицевойСчет", ЭлементМассива);
			
			Поиск = Объект.ТаблицаВыбора.НайтиСтроки(Отбор);
			
			Если Поиск.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			НоваяСтрока = Объект.ТаблицаВыбора.Добавить();
			
			НоваяСтрока.Услуга      = Услуга;
			НоваяСтрока.ЛицевойСчет = ЭлементМассива;
			НоваяСтрока.Адрес       = "ул. " + ПолучитьУлицуЛицевогоСчетаНаСервере(ЭлементМассива) + ", д. " + ПолучитьЗданиеНаСервере(ЭлементМассива) + ", кв. " + ПолучитьКвартируНаСервере(ЭлементМассива);			
			НоваяСтрока.Здание      = ПолучитьЗданиеНаСервере(ЭлементМассива);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ПересчитатьЭлементы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИПеренести(Команда)
	ТекущаяУслуга = Элементы.СписокУслуг.ТекущиеДанные;
	
	Выделение = Элементы.СписокЛицевыхСчетов.ВыделенныеСтроки;
	
	Если НЕ Выделение = Неопределено Тогда
		
		Отбор = Новый Структура;		
		Услуга = Неопределено;
			
		Если НЕ ТекущаяУслуга = Неопределено Тогда
				Услуга = ТекущаяУслуга.Значение;
		КонецЕсли;

		Отбор.Очистить();
		Отбор.Вставить("Услуга"     , Услуга);
		Отбор.Вставить("ЛицевойСчет", Выделение[0]);

		Для каждого ЭлементМассива Из Выделение Цикл
			
			// 5.12.2018 - услуга присваивается однократно
			//Услуга = Неопределено;
			//
			//Если НЕ ТекущаяУслуга = Неопределено Тогда
			//	Услуга = ТекущаяУслуга.Значение;
			//КонецЕсли;
			
			// 5.12.2018 - услуга присваивается однократно
			//Отбор.Очистить();
			//Отбор.Вставить("Услуга"     , Услуга);
			//Отбор.Вставить("ЛицевойСчет", ЭлементМассива);
            //Отбор.Вставить("ЛицевойСчет", ЭлементМассива);
			
			Отбор.ЛицевойСчет = ЭлементМассива; 
			Поиск = Объект.ТаблицаВыбора.НайтиСтроки(Отбор);
			
			Если Поиск.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			НоваяСтрока = Объект.ТаблицаВыбора.Добавить();
			
			НоваяСтрока.Услуга      = Услуга;
			НоваяСтрока.ЛицевойСчет = ЭлементМассива;
			// 5.12.2018 - не используется
			//НоваяСтрока.Адрес       = "ул. " + ПолучитьУлицуЛицевогоСчетаНаСервере(ЭлементМассива) + ", д. " + ПолучитьЗданиеНаСервере(ЭлементМассива) + ", кв. " + ПолучитьКвартируНаСервере(ЭлементМассива);			
			//НоваяСтрока.Здание      = ПолучитьЗданиеНаСервере(ЭлементМассива);
			
		КонецЦикла;
		
	КонецЕсли;
	
    ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK);

КонецПроцедуры

#КонецОбласти
